app/controllers/application_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."opinion_id" = ?  [["opinion_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= User.includes(:opinions, opinions: :likes).find(session[:user_id]) if session[:user_id]